7767517
15 17
Input            data             0 1 data 0=24 1=24 2=3
Convolution      conv1_1          1 1 data conv1_1 0=16 1=3 2=1 3=2 4=0 5=1 6=432
ReLU             relu1_1          1 1 conv1_1 conv1_1_relu1_1
Convolution      conv2_1          1 1 conv1_1_relu1_1 conv2_1 0=32 1=3 2=1 3=2 4=0 5=1 6=4608
ReLU             relu2_1          1 1 conv2_1 conv2_1_relu2_1
Convolution      conv3_1          1 1 conv2_1_relu2_1 conv3_1 0=64 1=3 2=1 3=2 4=0 5=1 6=18432
ReLU             relu3_1          1 1 conv3_1 conv3_1_relu3_1
Convolution      fc4_1            1 1 conv3_1_relu3_1 fc4_1 0=128 1=2 2=1 3=1 4=0 5=1 6=32768
ReLU             relu4_1          1 1 fc4_1 fc4_1_relu4_1
Split            splitncnn_0      1 3 fc4_1_relu4_1 fc4_1_relu4_1_splitncnn_0 fc4_1_relu4_1_splitncnn_1 fc4_1_relu4_1_splitncnn_2
Convolution      fc5_1            1 1 fc4_1_relu4_1_splitncnn_2 fc5_1 0=2 1=1 2=1 3=1 4=0 5=1 6=256
Softmax          cls_prob         1 1 fc5_1 cls_prob 0=0
Convolution      fc6_1            1 1 fc4_1_relu4_1_splitncnn_1 fc6_1 0=2 1=1 2=1 3=1 4=0 5=1 6=256
Softmax          rotate_cls_prob  1 1 fc6_1 rotate_cls_prob 0=0
Convolution      bbox_reg_1       1 1 fc4_1_relu4_1_splitncnn_0 bbox_reg_1 0=3 1=1 2=1 3=1 4=0 5=1 6=384
