7767517
19 21
Input            data             0 1 data 0=48 1=48 2=3
Convolution      conv1_3          1 1 data conv1_3 0=24 1=3 2=1 3=1 4=0 5=1 6=648
Pooling          pool1_3          1 1 conv1_3 pool1_3 0=0 1=3 2=2 3=0 4=0
ReLU             relu1_3          1 1 pool1_3 pool1_3_relu1_3
Convolution      conv2_3          1 1 pool1_3_relu1_3 conv2_3 0=48 1=3 2=1 3=1 4=0 5=1 6=10368
Pooling          pool2_3          1 1 conv2_3 pool2_3 0=0 1=3 2=2 3=0 4=0
ReLU             relu2_3          1 1 pool2_3 pool2_3_relu2_3
Convolution      conv3_3          1 1 pool2_3_relu2_3 conv3_3 0=96 1=3 2=1 3=1 4=0 5=1 6=41472
Pooling          pool3_3          1 1 conv3_3 pool3_3 0=0 1=2 2=2 3=0 4=0
ReLU             relu3_3          1 1 pool3_3 pool3_3_relu3_3
Convolution      conv4_3          1 1 pool3_3_relu3_3 conv4_3 0=144 1=2 2=1 3=1 4=0 5=1 6=55296
ReLU             relu4_3          1 1 conv4_3 conv4_3_relu4_3
InnerProduct     fc5_3            1 1 conv4_3_relu4_3 fc5_3 0=192 1=1 2=248832
ReLU             relu5_3          1 1 fc5_3 fc5_3_relu5_3
Split            splitncnn_0      1 3 fc5_3_relu5_3 fc5_3_relu5_3_splitncnn_0 fc5_3_relu5_3_splitncnn_1 fc5_3_relu5_3_splitncnn_2
InnerProduct     fc6_3            1 1 fc5_3_relu5_3_splitncnn_2 fc6_3 0=2 1=1 2=384
Softmax          cls_prob         1 1 fc6_3 cls_prob 0=0
InnerProduct     bbox_reg_3       1 1 fc5_3_relu5_3_splitncnn_1 bbox_reg_3 0=3 1=1 2=576
InnerProduct     rotate_reg_3     1 1 fc5_3_relu5_3_splitncnn_0 rotate_reg_3 0=1 1=1 2=192
